---
type: StructuralSectionISplitSlopedFlange
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionISplitSlopedFlange

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionISplitSlopedFlange | 2015 | `public StructuralSectionISplitSlopedFlange ( double width , double height , double flangeThickness , double flangeThicknessLocation , double webThickness , double webFillet , double flangeFillet , double centroidHorizont` |
| Property | BoltDiameter | 2015 | `public double BoltDiameter { get ; set ; }` |
| Property | BoltSpacing | 2015 | `public double BoltSpacing { get ; set ; }` |
| Property | ClearWebHeight | 2015 | `public double ClearWebHeight { get ; set ; }` |